Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/cvd.h
/* -------- CVD_CVDTX : (CVD Offset: 0xC0) (R/W 32) CVD TRANSMIT INDEX NCONFIGURATION -------- */
#define CVD_CVDTX_RESETVALUE                  _UINT32_(0x00)                                       /*  (CVD_CVDTX) CVD TRANSMIT INDEX NCONFIGURATION  Reset Value */

#define CVD_CVDTX_TXAN0_Pos                   _UINT32_(0)                                          /* (CVD_CVDTX) CVDT channel to use for TX Index Position */
#define CVD_CVDTX_TXAN0_Msk                   (_UINT32_(0x3F) << CVD_CVDTX_TXAN0_Pos)              /* (CVD_CVDTX) CVDT channel to use for TX Index Mask */
#define CVD_CVDTX_TXAN0(value)                (CVD_CVDTX_TXAN0_Msk & (_UINT32_(value) << CVD_CVDTX_TXAN0_Pos)) /* Assigment of value for TXAN0 in the CVD_CVDTX register */
#define CVD_CVDTX_TXAN1_Pos                   _UINT32_(8)                                          /* (CVD_CVDTX) CVDT channel to use for TX Index Position */
#define CVD_CVDTX_TXAN1_Msk                   (_UINT32_(0x3F) << CVD_CVDTX_TXAN1_Pos)              /* (CVD_CVDTX) CVDT channel to use for TX Index Mask */
#define CVD_CVDTX_TXAN1(value)                (CVD_CVDTX_TXAN1_Msk & (_UINT32_(value) << CVD_CVDTX_TXAN1_Pos)) /* Assigment of value for TXAN1 in the CVD_CVDTX register */
#define CVD_CVDTX_TXAN2_Pos                   _UINT32_(16)                                         /* (CVD_CVDTX) CVDT channel to use for TX Index Position */
#define CVD_CVDTX_TXAN2_Msk                   (_UINT32_(0x3F) << CVD_CVDTX_TXAN2_Pos)              /* (CVD_CVDTX) CVDT channel to use for TX Index Mask */
#define CVD_CVDTX_TXAN2(value)                (CVD_CVDTX_TXAN2_Msk & (_UINT32_(value) << CVD_CVDTX_TXAN2_Pos)) /* Assigment of value for TXAN2 in the CVD_CVDTX register */
#define CVD_CVDTX_TXAN3_Pos                   _UINT32_(24)                                         /* (CVD_CVDTX) CVDT channel to use for TX Index Position */
#define CVD_CVDTX_TXAN3_Msk                   (_UINT32_(0x3F) << CVD_CVDTX_TXAN3_Pos)              /* (CVD_CVDTX) CVDT channel to use for TX Index Mask */
#define CVD_CVDTX_TXAN3(value)                (CVD_CVDTX_TXAN3_Msk & (_UINT32_(value) << CVD_CVDTX_TXAN3_Pos)) /* Assigment of value for TXAN3 in the CVD_CVDTX register */
#define CVD_CVDTX_Msk                         _UINT32_(0x3F3F3F3F)                                 /* (CVD_CVDTX) Register Mask  */


/* -------- CVD_CVDSD0C1 : (CVD Offset: 0x100) (R/W 32) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER -------- */
#define CVD_CVDSD0C1_RESETVALUE               _UINT32_(0x00)                                       /*  (CVD_CVDSD0C1) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER  Reset Value */

#define CVD_CVDSD0C1_SDOVRSAMP_Pos            _UINT32_(0)                                          /* (CVD_CVDSD0C1) Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated Position */
#define CVD_CVDSD0C1_SDOVRSAMP_Msk            (_UINT32_(0x7F) << CVD_CVDSD0C1_SDOVRSAMP_Pos)       /* (CVD_CVDSD0C1) Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated Mask */
#define CVD_CVDSD0C1_SDOVRSAMP(value)         (CVD_CVDSD0C1_SDOVRSAMP_Msk & (_UINT32_(value) << CVD_CVDSD0C1_SDOVRSAMP_Pos)) /* Assigment of value for SDOVRSAMP in the CVD_CVDSD0C1 register */
#define CVD_CVDSD0C1_SDTH_Pos                 _UINT32_(8)                                          /* (CVD_CVDSD0C1) Scan Descriptor Threshold. Position */
#define CVD_CVDSD0C1_SDTH_Msk                 (_UINT32_(0xFFFFFF) << CVD_CVDSD0C1_SDTH_Pos)        /* (CVD_CVDSD0C1) Scan Descriptor Threshold. Mask */
#define CVD_CVDSD0C1_SDTH(value)              (CVD_CVDSD0C1_SDTH_Msk & (_UINT32_(value) << CVD_CVDSD0C1_SDTH_Pos)) /* Assigment of value for SDTH in the CVD_CVDSD0C1 register */
#define CVD_CVDSD0C1_Msk                      _UINT32_(0xFFFFFF7F)                                 /* (CVD_CVDSD0C1) Register Mask  */


/* -------- CVD_CVDSD1C1 : (CVD Offset: 0x110) (R/W 32) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER -------- */
#define CVD_CVDSD1C1_RESETVALUE               _UINT32_(0x00)                                       /*  (CVD_CVDSD1C1) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER  Reset Value */

#define CVD_CVDSD1C1_SDOVRSAMP_Pos            _UINT32_(0)                                          /* (CVD_CVDSD1C1) Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated Position */
#define CVD_CVDSD1C1_SDOVRSAMP_Msk            (_UINT32_(0x7F) << CVD_CVDSD1C1_SDOVRSAMP_Pos)       /* (CVD_CVDSD1C1) Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated Mask */
#define CVD_CVDSD1C1_SDOVRSAMP(value)         (CVD_CVDSD1C1_SDOVRSAMP_Msk & (_UINT32_(value) << CVD_CVDSD1C1_SDOVRSAMP_Pos)) /* Assigment of value for SDOVRSAMP in the CVD_CVDSD1C1 register */
#define CVD_CVDSD1C1_SDTH_Pos                 _UINT32_(8)                                          /* (CVD_CVDSD1C1) Scan Descriptor Threshold. Position */
#define CVD_CVDSD1C1_SDTH_Msk                 (_UINT32_(0xFFFFFF) << CVD_CVDSD1C1_SDTH_Pos)        /* (CVD_CVDSD1C1) Scan Descriptor Threshold. Mask */
#define CVD_CVDSD1C1_SDTH(value)              (CVD_CVDSD1C1_SDTH_Msk & (_UINT32_(value) << CVD_CVDSD1C1_SDTH_Pos)) /* Assigment of value for SDTH in the CVD_CVDSD1C1 register */
#define CVD_CVDSD1C1_Msk                      _UINT32_(0xFFFFFF7F)                                 /* (CVD_CVDSD1C1) Register Mask  */


/* -------- CVD_CVDSD2C1 : (CVD Offset: 0x120) (R/W 32) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER -------- */
#define CVD_CVDSD2C1_RESETVALUE               _UINT32_(0x00)                                       /*  (CVD_CVDSD2C1) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER  Reset Value */

#define CVD_CVDSD2C1_SDOVRSAMP_Pos            _UINT32_(0)                                          /* (CVD_CVDSD2C1) Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated Position */
#define CVD_CVDSD2C1_SDOVRSAMP_Msk            (_UINT32_(0x7F) << CVD_CVDSD2C1_SDOVRSAMP_Pos)       /* (CVD_CVDSD2C1) Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated Mask */
#define CVD_CVDSD2C1_SDOVRSAMP(value)         (CVD_CVDSD2C1_SDOVRSAMP_Msk & (_UINT32_(value) << CVD_CVDSD2C1_SDOVRSAMP_Pos)) /* Assigment of value for SDOVRSAMP in the CVD_CVDSD2C1 register */
#define CVD_CVDSD2C1_SDTH_Pos                 _UINT32_(8)                                          /* (CVD_CVDSD2C1) Scan Descriptor Threshold. Position */
#define CVD_CVDSD2C1_SDTH_Msk                 (_UINT32_(0xFFFFFF) << CVD_CVDSD2C1_SDTH_Pos)        /* (CVD_CVDSD2C1) Scan Descriptor Threshold. Mask */
#define CVD_CVDSD2C1_SDTH(value)              (CVD_CVDSD2C1_SDTH_Msk & (_UINT32_(value) << CVD_CVDSD2C1_SDTH_Pos)) /* Assigment of value for SDTH in the CVD_CVDSD2C1 register */
#define CVD_CVDSD2C1_Msk                      _UINT32_(0xFFFFFF7F)                                 /* (CVD_CVDSD2C1) Register Mask  */


/* -------- CVD_CVDSD3C1 : (CVD Offset: 0x130) (R/W 32) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER -------- */
#define CVD_CVDSD3C1_RESETVALUE               _UINT32_(0x00)                                       /*  (CVD_CVDSD3C1) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER  Reset Value */

