Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/cvd.h
/* -------- CVD_CVDSD1T2 : (CVD Offset: 0x11C) (R/W 32) CVD SCAN DESCRIPTOR N TIME2 REGISTER -------- */
#define CVD_CVDSD1T2_RESETVALUE               _UINT32_(0x00)                                       /*  (CVD_CVDSD1T2) CVD SCAN DESCRIPTOR N TIME2 REGISTER  Reset Value */

#define CVD_CVDSD1T2_SDCONTIME_Pos            _UINT32_(0)                                          /* (CVD_CVDSD1T2) Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CONVERT statewaiting for the ADC sample data. It must be ensured that the ADC will assert End-Of-Convert (EOC) before the CONVERT state timer expires. Position */
#define CVD_CVDSD1T2_SDCONTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD1T2_SDCONTIME_Pos)       /* (CVD_CVDSD1T2) Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CONVERT statewaiting for the ADC sample data. It must be ensured that the ADC will assert End-Of-Convert (EOC) before the CONVERT state timer expires. Mask */
#define CVD_CVDSD1T2_SDCONTIME(value)         (CVD_CVDSD1T2_SDCONTIME_Msk & (_UINT32_(value) << CVD_CVDSD1T2_SDCONTIME_Pos)) /* Assigment of value for SDCONTIME in the CVD_CVDSD1T2 register */
#define CVD_CVDSD1T2_SDPOLTIME_Pos            _UINT32_(8)                                          /* (CVD_CVDSD1T2) Scan Descriptor Polarity TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the POLARITY statebefore taking the second polarity measurement of an RX/TX pair Position */
#define CVD_CVDSD1T2_SDPOLTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD1T2_SDPOLTIME_Pos)       /* (CVD_CVDSD1T2) Scan Descriptor Polarity TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the POLARITY statebefore taking the second polarity measurement of an RX/TX pair Mask */
#define CVD_CVDSD1T2_SDPOLTIME(value)         (CVD_CVDSD1T2_SDPOLTIME_Msk & (_UINT32_(value) << CVD_CVDSD1T2_SDPOLTIME_Pos)) /* Assigment of value for SDPOLTIME in the CVD_CVDSD1T2 register */
#define CVD_CVDSD1T2_SDOVRTIME_Pos            _UINT32_(16)                                         /* (CVD_CVDSD1T2) Scan Descriptor Oversample TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the OVERSAMPstate before taking the next oversampling measurement of an RX/TX pair. Position */
#define CVD_CVDSD1T2_SDOVRTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD1T2_SDOVRTIME_Pos)       /* (CVD_CVDSD1T2) Scan Descriptor Oversample TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the OVERSAMPstate before taking the next oversampling measurement of an RX/TX pair. Mask */
#define CVD_CVDSD1T2_SDOVRTIME(value)         (CVD_CVDSD1T2_SDOVRTIME_Msk & (_UINT32_(value) << CVD_CVDSD1T2_SDOVRTIME_Pos)) /* Assigment of value for SDOVRTIME in the CVD_CVDSD1T2 register */
#define CVD_CVDSD1T2_SDCHNTIME_Pos            _UINT32_(24)                                         /* (CVD_CVDSD1T2) Scan Descriptor Channel TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the RXCHAN orTXCHAN state before moving to the next RX/TX pair Position */
#define CVD_CVDSD1T2_SDCHNTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD1T2_SDCHNTIME_Pos)       /* (CVD_CVDSD1T2) Scan Descriptor Channel TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the RXCHAN orTXCHAN state before moving to the next RX/TX pair Mask */
#define CVD_CVDSD1T2_SDCHNTIME(value)         (CVD_CVDSD1T2_SDCHNTIME_Msk & (_UINT32_(value) << CVD_CVDSD1T2_SDCHNTIME_Pos)) /* Assigment of value for SDCHNTIME in the CVD_CVDSD1T2 register */
#define CVD_CVDSD1T2_Msk                      _UINT32_(0x7F7F7F7F)                                 /* (CVD_CVDSD1T2) Register Mask  */


/* -------- CVD_CVDSD2T2 : (CVD Offset: 0x12C) (R/W 32) CVD SCAN DESCRIPTOR N TIME2 REGISTER -------- */
#define CVD_CVDSD2T2_RESETVALUE               _UINT32_(0x00)                                       /*  (CVD_CVDSD2T2) CVD SCAN DESCRIPTOR N TIME2 REGISTER  Reset Value */

#define CVD_CVDSD2T2_SDCONTIME_Pos            _UINT32_(0)                                          /* (CVD_CVDSD2T2) Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CONVERT statewaiting for the ADC sample data. It must be ensured that the ADC will assert End-Of-Convert (EOC) before the CONVERT state timer expires. Position */
#define CVD_CVDSD2T2_SDCONTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD2T2_SDCONTIME_Pos)       /* (CVD_CVDSD2T2) Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CONVERT statewaiting for the ADC sample data. It must be ensured that the ADC will assert End-Of-Convert (EOC) before the CONVERT state timer expires. Mask */
#define CVD_CVDSD2T2_SDCONTIME(value)         (CVD_CVDSD2T2_SDCONTIME_Msk & (_UINT32_(value) << CVD_CVDSD2T2_SDCONTIME_Pos)) /* Assigment of value for SDCONTIME in the CVD_CVDSD2T2 register */
#define CVD_CVDSD2T2_SDPOLTIME_Pos            _UINT32_(8)                                          /* (CVD_CVDSD2T2) Scan Descriptor Polarity TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the POLARITY statebefore taking the second polarity measurement of an RX/TX pair Position */
#define CVD_CVDSD2T2_SDPOLTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD2T2_SDPOLTIME_Pos)       /* (CVD_CVDSD2T2) Scan Descriptor Polarity TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the POLARITY statebefore taking the second polarity measurement of an RX/TX pair Mask */
#define CVD_CVDSD2T2_SDPOLTIME(value)         (CVD_CVDSD2T2_SDPOLTIME_Msk & (_UINT32_(value) << CVD_CVDSD2T2_SDPOLTIME_Pos)) /* Assigment of value for SDPOLTIME in the CVD_CVDSD2T2 register */
#define CVD_CVDSD2T2_SDOVRTIME_Pos            _UINT32_(16)                                         /* (CVD_CVDSD2T2) Scan Descriptor Oversample TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the OVERSAMPstate before taking the next oversampling measurement of an RX/TX pair. Position */
#define CVD_CVDSD2T2_SDOVRTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD2T2_SDOVRTIME_Pos)       /* (CVD_CVDSD2T2) Scan Descriptor Oversample TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the OVERSAMPstate before taking the next oversampling measurement of an RX/TX pair. Mask */
#define CVD_CVDSD2T2_SDOVRTIME(value)         (CVD_CVDSD2T2_SDOVRTIME_Msk & (_UINT32_(value) << CVD_CVDSD2T2_SDOVRTIME_Pos)) /* Assigment of value for SDOVRTIME in the CVD_CVDSD2T2 register */
#define CVD_CVDSD2T2_SDCHNTIME_Pos            _UINT32_(24)                                         /* (CVD_CVDSD2T2) Scan Descriptor Channel TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the RXCHAN orTXCHAN state before moving to the next RX/TX pair Position */
#define CVD_CVDSD2T2_SDCHNTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD2T2_SDCHNTIME_Pos)       /* (CVD_CVDSD2T2) Scan Descriptor Channel TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the RXCHAN orTXCHAN state before moving to the next RX/TX pair Mask */
#define CVD_CVDSD2T2_SDCHNTIME(value)         (CVD_CVDSD2T2_SDCHNTIME_Msk & (_UINT32_(value) << CVD_CVDSD2T2_SDCHNTIME_Pos)) /* Assigment of value for SDCHNTIME in the CVD_CVDSD2T2 register */
#define CVD_CVDSD2T2_Msk                      _UINT32_(0x7F7F7F7F)                                 /* (CVD_CVDSD2T2) Register Mask  */


/* -------- CVD_CVDSD3T2 : (CVD Offset: 0x13C) (R/W 32) CVD SCAN DESCRIPTOR N TIME2 REGISTER -------- */
#define CVD_CVDSD3T2_RESETVALUE               _UINT32_(0x00)                                       /*  (CVD_CVDSD3T2) CVD SCAN DESCRIPTOR N TIME2 REGISTER  Reset Value */

